In [1]:
import pandas as pd
import numpy as np

In [2]:
dict_1={
    "Nombre":["Ringo","John","Paul","George","Yoko"],
    "Edad":[45,34,42,38,47],
    "Salario":[12000,14000,13000,11000,10000],
    "Genero":["M","M","M","M","F"]
}

In [3]:
data=pd.DataFrame(dict_1)

In [8]:
data.head()

   Nombre  Edad  Salario Genero
0   Ringo    45    12000      M
1    John    34    14000      M
2    Paul    42    13000      M
3  George    38    11000      M
4    Yoko    47    10000      F

In [9]:
datos_categoricos=data.select_dtypes(exclude=[np.number]) #Excluir info numerica y seleccionar el resto
print("La base contiene {0} datos categóricos".format(datos_categoricos.shape[1]))

La base contiene 2 datos categóricos

In [11]:
data.dtypes #Tipo de datos de cada columna

Nombre     object
Edad        int64
Salario     int64
Genero     object
dtype: object

In [12]:
data.describe()

            Edad      Salario
count   5.000000      5.00000
mean   41.200000  12000.00000
std     5.263079   1581.13883
min    34.000000  10000.00000
25%    38.000000  11000.00000
50%    42.000000  12000.00000
75%    45.000000  13000.00000
max    47.000000  14000.00000

In [14]:
data.median(numeric_only=True)

Edad          42.0
Salario    12000.0
dtype: float64

In [15]:
data.count()

Nombre     5
Edad       5
Salario    5
Genero     5
dtype: int64

In [17]:
data.mean(numeric_only=True)

Edad          41.2
Salario    12000.0
dtype: float64

In [19]:
data.mode(numeric_only=True)

   Edad  Salario
0    34    10000
1    38    11000
2    42    12000
3    45    13000
4    47    14000

In [20]:
data.std(numeric_only=True)

Edad          5.263079
Salario    1581.138830
dtype: float64

In [21]:
data.sum()

Nombre     RingoJohnPaulGeorgeYoko
Edad                           206
Salario                      60000
Genero                       MMMMF
dtype: object

In [22]:
data.max()

Nombre      Yoko
Edad          47
Salario    14000
Genero         M
dtype: object

In [23]:
data.min()

Nombre     George
Edad           34
Salario     10000
Genero          F
dtype: object

In [24]:
data[data["Edad"]==data["Edad"].min()]

  Nombre  Edad  Salario Genero
1   John    34    14000      M

In [29]:
data["Edad"].abs

<bound method NDFrame.abs of 0    45
1    34
2    42
3    38
4    47
Name: Edad, dtype: int64>

In [30]:
data.prod(numeric_only=True)

Edad                114768360
Salario    432327041775828992
dtype: int64

In [31]:
data.cumsum()

                    Nombre  Edad  Salario Genero
0                    Ringo    45    12000      M
1                RingoJohn    79    26000     MM
2            RingoJohnPaul   121    39000    MMM
3      RingoJohnPaulGeorge   159    50000   MMMM
4  RingoJohnPaulGeorgeYoko   206    60000  MMMMF

In [32]:
data["Edad"].cumprod()

0           45
1         1530
2        64260
3      2441880
4    114768360
Name: Edad, dtype: int64

In [33]:
data

   Nombre  Edad  Salario Genero
0   Ringo    45    12000      M
1    John    34    14000      M
2    Paul    42    13000      M
3  George    38    11000      M
4    Yoko    47    10000      F

In [34]:
data2=pd.get_dummies(data[["Genero"]])

In [35]:
data2

   Genero_F  Genero_M
0         0         1
1         0         1
2         0         1
3         0         1
4         1         0

In [36]:
data2.value_counts()

Genero_F  Genero_M
0         1           4
1         0           1
dtype: int64